In [4]:
import pandas as pd

employees = pd.read_csv('employees.csv')

The 'employees.csv' file contains data of employees of one of the IT companies. Display employee list. Then, calculate and display:

Number of women and men

In [24]:
employees.loc[:,['sex', 'first_name']].groupby(['sex']).count().rename(columns={'first_name': 'number'})

        number
sex
Female       7
Male        13

Number of employees by country

In [27]:
employees.loc[:,['country', 'first_name']].groupby('country').count() \
.rename(columns={'first_name': 'number'})

                number
country
Czech Republic      11
Poland               8
United Kingdom       1

Number of women and men by country

In [35]:
employees.loc[:,['country', 'sex', 'first_name']].groupby(['country', 'sex']).count() \
.rename(columns={'first_name': 'number'})

                       number
country        sex
Czech Republic Female       3
               Male         8
Poland         Female       4
               Male         4
United Kingdom Male         1

Average age of employees

In [37]:
employees.loc[:,['age']].mean()

age    45.15
dtype: float64

Average age of women and men

In [38]:
employees.loc[:,['sex', 'age']].groupby('sex').mean()

              age
sex
Female  38.428571
Male    48.769231

Average salary in the company

In [39]:
employees.loc[:,['salary']].mean()

salary    73804.416
dtype: float64

Average salary of women and men

In [40]:
employees.loc[:,['sex', 'salary']].groupby('sex').mean()

              salary
sex
Female  82115.781429
Male    69329.065385

Minimum age of women and men by country. Sort the results in descending order

In [57]:
employees.loc[:,['country', 'sex', 'age']].groupby(['country', 'sex']).min() \
.sort_values('age', ascending=False)

                       age
country        sex
Poland         Male     47
United Kingdom Male     37
Czech Republic Male     35
               Female   20
Poland         Female   19

Median salary of women and men by country

In [58]:
employees.loc[:,['country', 'sex', 'salary']].groupby(['country', 'sex']).median()

                           salary
country        sex
Czech Republic Female   44973.700
               Male     57259.410
Poland         Female  107833.315
               Male     72688.560
United Kingdom Male    148308.960

Median salary of women and men by country. Save the results to a csv file

In [62]:
employees.loc[:,['country', 'sex', 'salary']].groupby(['country', 'sex']).median() \
.to_csv('employees-median.csv')